package ru.lebedev.se.HomeWork4;

/**
 * Java 3, JavaLevel3.
 *
 * @author Anatoly Lebedev
 * @version 1.0.0 10.02.2019
 * @link https://github.com/Centnerman
 */

/*
1. Создать три потока, каждый из которых выводит определенную букву (A, B и C) 5 раз (порядок – ABСABСABС). Используйте wait/notify/notifyAll.
2. Прочитать файл (около 50 байт) в байтовый массив и вывести этот массив в консоль;
3. Последовательно сшить 5 файлов в один (файлы примерно 100 байт).
 Может пригодиться следующая конструкция:
ArrayList<InputStream> al = new ArrayList<>();
...
Enumeration<InputStream> e = Collections.enumeration(al);

4. Написать консольное приложение, которое умеет постранично читать текстовые файлы
(размером > 10 mb). Вводим страницу (за страницу можно принять 1800 символов), программа
выводит ее в консоль. Контролируем время выполнения: программа не должна загружаться
дольше 10 секунд, а чтение – занимать свыше 5 секунд.
 */

public class Home {
}
